{"_id":{"$oid":"61c8be8356c68f96a5a32945"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathen Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":false}
{"_id":{"$oid":"61c8c0c956c68f96a5a32946"},"Title":"The Lion King","Description":"This Disney animated feature follows the adventures of the young lion Simba.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Rob Minkoff","Bio":"Robert Ralph Minkoff is an American filmmaker. He is known for directing the double Academy Award-winning animated feature The Lion King, along with directing Stuart Little.","Birth":"1962"},"ImagePath":"thelionking.png","Featured":false}
{"_id":{"$oid":"61c8cc21ddd22c3a209f2030"},"Title":"Beetlejuice","Description":"After Barbara and Adam Maitland die in a car accident, they find themselves stuck haunting their country residence, unable to leave the house. When the unbearable Deetzes and teen daughter Lydia buy the home, the Maitlands attempt to scare them away without success. Their efforts attract Beetlejuice, a rambunctious spirit whose help quickly becomes dangerous for the Maitlands and innocent Lydia.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Tim Burton","Bio":"Timothy Walter Burton is an American film director, producer, writer and artist. He is known for his gothicfantasy and horror films such as Beetlejuice, Edward Scissorhands, The Nightmare Before Christmas, Ed Wood, Sleepy Hollow, Corpse Bride, Sweeney Todd, and Frankenweenie.","Birth":"1958"},"ImagePath":"beetlejuice.png","Featured":false}
{"_id":{"$oid":"61c8ce04ddd22c3a209f2031"},"Title":"E.T. the Extra-Terrestrial","Description":"After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliot. Bringing the extraterrestrial into his suburban California house, Elliot introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie, and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliot and the alient.","Genre":{"Name":"Sci-Fi","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allen Spielberg is an American film director, producer, and screenwriter. He began his career in the New Hollywood era and is currently the most commercially successful director.","Birth":"1946"},"ImagePath":"ettheextraterrestrial.png","Featured":false}
{"_id":{"$oid":"61c8e249ddd22c3a209f2032"},"Title":"Doctor Sleep","Description":"Struggling with alcoholism, Dan Torrance remains traumatized by the sinister events that occurred at the Overlook Hotel when he was a child. His hope for a peaceful existence soon becomes shattered when he meets Abra, a teen who shares his extrasensory gift, the shine. Together, they form an unlikely alliance to battle the True Knot, a cult whose members try to feed off the shine of innocents to become immortal.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Mike Flanagan","Bio":"Mike Flanagan is an American filmmaker and partner in Intrepid Pictures. He is best known for his horror films, all of which he directed, wrote, and edited, including Absentia, Oculus, Hush, Before I Wake, and Doctor Sleep","Birth":"1978"},"ImagePath":"doctorsleep.png","Featured":true}
{"_id":{"$oid":"61c8e3c7ddd22c3a209f2033"},"Title":"Rear Window","Description":"The story of a recuperating news photographer who believes he has witnessed a murder. Confined to a wheelchair after an accident, he spends his time watching the occupants of neighbouring apartments through a telephoto lens and binoculars and becomes convinced that a murder has taken place.","Genre":{"Name":"Myster","Description":"A myster film is a genre of film that revolves around the solution of a problem or a crime. It focuses on the efforts of the detective, private investigator or amateur sleuth to solve the mysterious circumstances of an issue by means of clues, investigation, and clever deduction."},"Director":{"Name":"Alfred Hitchcock","Bio":"Sir Alfred Joseph Hitchcock KBE was an English filmmaker who was one of the most influential figures in the history of cinema. In a career spanning six decades, he directed over 50 feature films that are still widely watched and studied today.","Birth":"1899","Death":"1980"},"ImagePath":"rearwindow.png","Featured":false}
{"_id":{"$oid":"61c8e50cddd22c3a209f2034"},"Title":"Inglourious Basterds","Description":"In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, producer, film critic, and actor. His films are characterized by nonlinear storylines, dark humor, stylized violence, extended dialogue, ensemble casts, references to popular culture, alternate history, and neo-noir.","Birth":"1963"},"ImagePath":"inglouriousbasterds.png","Featured":false}
{"_id":{"$oid":"61c8e6afddd22c3a209f2035"},"Title":"The Nightmare Before Christmas","Description":"The film follows the misadventures of Jack Skellington, Halloweentown's beloved Pumpkin King, who has become bored with the same annual routine of frightening people in the real world. When Jack accidentally stumbles on Christmastown, all bright colors and warm spirits, he gets a new lease on life - he plots to bring Christmas under his control by kidnapping Santa Claus and taking over the role. But Jack soon discovers that even the best-laid plans of mice and skeleton men can go seriously awry.","Genre":{"Title":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Henry Selick","Bio":"Henry Selick is an American stop motion director, producer, and writer who is best known for directing the stop-motion animation films The Nightmare Before Christmas, James and the Giant Peach, Coraline, and his upcoming stop-motion film Wendell and Wild with Jordan Peele and Keegan-Michael Key.","Birth":"1952"},"ImagePath":"thenightmarebeforechristmas.png","featured":false}
{"_id":{"$oid":"61c8ef6dddd22c3a209f2037"},"Title":"The Dark Knight","Description":"With the help of allies Lt. Jim Gordon and DA Harvey Dent, Batman has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker suddenly throws the town into chaos, the Caped Crusader begins to tread a fine line between heroism and vigilantism.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British-American film director, producer, and screenwriter. His films have grossed more than 5 billion worldwide, and have garnered 11 Academy Awards from 36 nominations. Born and raised in London, Nolan developed an interest in filmmaking from a young age.","Birth":"1970"},"ImagePath":"thedarkknight.png","Featured":false}
{"_id":{"$oid":"61c8f1c3ddd22c3a209f2038"},"Title":"Goodfellas","Description":"A young man grows up in the mob and works very hard to advance himself through the ranks. He enjoys his life of money and luxury, but is oblvious to the horror that he causes. A drug addiction and a few mistakes ultimately unravel his climb to the top. Based on the book \"Wiseguy\" by Nicholas Pileggi.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters potrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Charles Scorsese is an American film director, producer, screenwriter, and actor. One of the major figures of the New Hollywood era, he is widely regarded as one of the greatest and most influential directors in film history.","Birth":"1942"},"ImagePath":"goodfellas.png","Featured":false}
{"_id":{"$oid":"61c8f4cb98e70ec496d8e24e"},"Title":"Oculus","Description":"A woman tries to exonerate her brother, who was convicted of murder, by proving that the crime was committed by a supernatural phenomenon.","Genre":{"Name":"Horror","Description":"A horror film is one that seeks to elicit fear or disgust in its audience for entertainment purposes. Horror films additionally aim to evoke its viewers nightmares, revulsions, and terror of the unknown or the macabre."},"Director":{"Name":"Mike Flanagan","Bio":"Mike Flanagan is an American filmmaker and partner in Intrepid Pictures. He is best known for his horror films, all of which he directed, wrote, and edited, including Absentia, Oculus, Hush, Before I Wake, and Doctor Sleep","Birth":"1978"},"ImagePath":"oculus.png","Featured":false}
{"_id":{"$oid":"61c8fa1898e70ec496d8e24f"},"Title":"Hush","Description":"A deaf and mute writer who retreated into the woods to live a solitary life must fight for her life in silence when a masked killer appears at her window.","Genre":{"Name":"Horror","Description":"A horror film is one that seeks to elicit fear or disgust in its audience for entertainment purposes. Horror films additionally aim to evoke its viewers nightmares, revulsions, and terror of the unknown of the macabre."},"Director":{"Name":" Mike Flanagan","Bio":"Mike Flanagan is an American filmmaker and partner in Intrepid Pictures. He is best known for his horror films, all of which he directed, wrote, and edited, including Absentia, Oculus, Hush, and Doctor Sleep.","Birth":"1978"},"ImagePath":"hush.png","Featured":false}
